snlkuharlocal/src/DataProcessors/ВыгрузкаДКДляСайта/ВыгрузкаДКДляСайта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаДКДляСайта</name>
  <attributes>
    <name>HTTPОбменАдресСкрипта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиИспользование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСсылка</name>
    <type>
      <types>CatalogRef.НастройкиОбменаССайтом</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоАдресаСкрипта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HTTPОбменПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Catalogs/ДисконтныеКарты/ДисконтныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДисконтныеКарты</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонДомашний</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЦВыдачи</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКлуба</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВступленияВКлуб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаСтарая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКлубаГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованДР2010</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКлуба2012</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>СМСРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочтаРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромоКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаДо2013</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ликвидирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АкционнаяДК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БылаРанееКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераДК</name>
    <attributes>
      <name>НомерДК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТЦРегистрации</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользованныеДР</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ВыгрузкаДКДляСайта/ObjectModule.bsl
Перем ПараметрЗапросаHTTP_Инициализация;
Перем ПараметрЗапросаHTTP_ПередачаФайла;
Перем ПараметрЗапросаHTTP_ИмпортФайлаСервером;
Перем ПараметрЗапросаHTTP_ПолучитьДанные; 
Перем ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта;

Перем ОтветСервера_ZIPРазрешен;
Перем ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена;
Перем ОтветСервера_УспешноеЗавершениеТекущейОперации;
Перем ОтветСервера_АварийноеЗавершениеТекущейОперации;
Перем ОтветСервера_ВыполнениеТекущейОперации;

Перем СтрокаШапка,СтрокаНиз;

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	табдок=ТаблицаПараметров[1].значение; 		  //здесь ссылка на настройку

	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТабДок); // заполяем параметры обработки данными.
	
	НачалоАдресаСкрипта = Табдок.HTTPОбменАдресСайта;
	СтруктураАдреса = ПроцедурыОбменаССайтом.РазобратьАдресСайта(НачалоАдресаСкрипта);
	
	HTTPОбменПорт = СтруктураАдреса.HTTPПорт;
	HTTPОбменСервер = СтруктураАдреса.HTTPСервер;
	HTTPОбменЗащищенноеСоединение = СтруктураАдреса.HTTPЗащищенноеСоединение;
	НачалоАдресаСкрипта = СтруктураАдреса.HTTPАдресСкрипта;
    HTTPОбменАдресСкрипта = НачалоАдресаСкрипта;
   	
	Если Не ЗначениеЗаполнено(ИмяФайлаВыгрузки) тогда
		ИмяФайлаВыгрузки=""+КаталогВременныхФайлов()+"DK.xml";
	Конецесли;
	
	ПолучитьИмяВременногоФайла();
	//Макет = ВнешняяОбработкаОбъект.ПолучитьМакет("Отчет");
	
	Запрос = Новый Запрос;
		
	Если Изменения тогда
		тз=новый таблицазначений;
		тз.Колонки.Добавить("НомерКарты");
		тз.Колонки.Добавить("СуммаНакопленныхСредств");
		тз.Колонки.Добавить("СкидкаПоКарте");
		
		выб=планыобмена.ВыбратьИзменения( планыобмена.ОбменССайтомТоварами.НайтиПоКоду("STP"),0);
		пока выб.Следующий() цикл
			объект=выб.Получить();
			если Объект.Метаданные().Имя="ДисконтныеКарты" тогда
				если объект.членклуба тогда
					нов=тз.Добавить();
					нов.номеркарты=объект.код;
					нов.СуммаНакопленныхСредств=объект.ОбщаяСумма;   
					Если объект.СкидкаСтарая > объект.Скидка тогда
						нов.скидкапокарте=Объект.СкидкаСтарая;
					иначе
						нов.скидкапокарте=Объект.Скидка;
					Конецесли;
				Конецесли;	
			Конецесли;
		Конеццикла;
		
	иначе
			
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ДисконтныеКарты.Код КАК НомерКарты,
		|	ДисконтныеКарты.ОбщаяСумма КАК СуммаНакопленныхСредств,
		|	ВЫБОР
		|		КОГДА ДисконтныеКарты.СкидкаСтарая > ДисконтныеКарты.Скидка
		|			ТОГДА ДисконтныеКарты.СкидкаСтарая
		|		ИНАЧЕ ДисконтныеКарты.Скидка
		|	КОНЕЦ КАК СкидкаПоКарте
		|ИЗ
		|	Справочник.ДисконтныеКарты КАК ДисконтныеКарты
		|ГДЕ
		|	ДисконтныеКарты.ЧленКлуба";
		
		Запрос.УстановитьПараметр("ЧленКлуба", ИСТИНА);
		
		Результат = Запрос.Выполнить();
		
		
		тз=результат.Выгрузить();
	Конецесли;

	текст=новый текстовыйдокумент;
	стр=значениевстрокувнутр(тз);
	текст.УстановитьТекст(стр);
	Текст.Вывод = ИспользованиеВывода.Разрешить;
	текст.Записать(Имяфайлавыгрузки);
	
	если ВыгрузитьДкНаСайт() тогда
		планыобмена.УдалитьРегистрациюИзменений(планыобмена.ОбменССайтомТоварами.НайтиПоКоду("STP"),метаданные.Справочники.ДисконтныеКарты);
	Конецесли;	
	
	//}}КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ
КонецПроцедуры


// Процедура проводит проверку значнеие и пишет текстовой узел в файл XML
//
// Параметры:
//  ОбъектXML - объект ЗаписьXML
//  Имя       - наименования узла
//  Значение  - текстовое значение для записи в файл
//
Процедура ЗаписатьТекстовойУзел(ОбъектXML, Имя, Значение, ОбязательнаяПроверкаНаПустуюСтроку = Истина)

	СтрокаЗаписи = Строка(Значение);
	Если ОбязательнаяПроверкаНаПустуюСтроку
		И НЕ ЗначениеЗаполнено(СтрокаЗаписи) Тогда
		
		Возврат;		
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, Символы.НПП, "");
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, ",", ".");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Если Значение Тогда
			СтрокаЗаписи = "true";
		Иначе
			СтрокаЗаписи = "false";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента(Имя);
	ОбъектXML.ЗаписатьТекст(СтрокаЗаписи);
	ОбъектXML.ЗаписатьКонецЭлемента();

КонецПроцедуры


Процедура СообщитьОбИсключительнойОшибке(ИнформацияОВыгрузке, ТекстНачалаСообщения =  "", ТекстОкончанияСообщения = "")
	
	РасширеннаяИнформацияОбОшибке = ИнформацияОбОшибке();
	ТекстСообщения = "";
	Если ЗначениеЗаполнено(ТекстНачалаСообщения) Тогда
		ТекстСообщения = ТекстНачалаСообщения + Символы.ПС;
	КонецЕсли;	
	ТекстСообщения = ТекстСообщения
	+ "Произошла ошибка: "
	+ РасширеннаяИнформацияОбОшибке.Описание;
	
	Если НЕ Строка(РасширеннаяИнформацияОбОшибке.Причина) = "ИнформацияОбОшибке" Тогда
		ТекстСообщения = ТекстСообщения
		+ ". По причине: "
		+ РасширеннаяИнформацияОбОшибке.Причина;
	КонецЕсли;	
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстОкончанияСообщения;
	
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	

Процедура СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, Статус = Неопределено)
	
	//Если ИнформацияОВыгрузке Тогда
	//	ДобавитьТекстКСообщениюДляПользователя(мСтруктураИнформацииИсторииОбмена.КомментарийКВыгрузкеДанных, ТекстСообщения);
	//Иначе
	//	ДобавитьТекстКСообщениюДляПользователя(мСтруктураИнформацииИсторииОбмена.КомментарийКЗагрузкеДанных, ТекстСообщения);
	//КонецЕсли;
	
	#Если Клиент Тогда
		Если Статус = Неопределено Тогда
			Статус = СтатусСообщения.Обычное;	
		КонецЕсли;
		Сообщить(ТекстСообщения, Статус);
	#Иначе
		ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация");                     
	#КонецЕсли
	
КонецПроцедуры	

Функция HTTPОтправитьФайлНаСервер(ПолноеИмяФайла, Соединение, ПараметрыЗапроса="", Заголовки="")
	
	ОтветСервера = Неопределено;
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
	
	Попытка
		Соединение.ОтправитьДляОбработки(ПолноеИмяФайла, СокрЛП(ПараметрыЗапроса), ИмяФайлаОтвета, СокрЛП(Заголовки));
	Исключение
		СообщитьОбИсключительнойОшибке(Истина, ОписаниеОшибки());
	КонецПопытки;	
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			СообщитьПользователю("Отправка файла на сервер: Получен пустой ответ сервера.", Истина); 	
		КонецЕсли;	
		
	Иначе	
		СообщитьПользователю("Отправка файла на сервер: Ответ сервера не получен.", Истина); 
	КонецЕсли;	
	
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаОтвета);   
	Исключение
	КонецПопытки;
	
	Возврат ОтветСервера;	
	
КонецФункции	

Функция ВыгрузитьДкНаСайт()
	
	ЗаписатьВЛог("ОбменССайтом"," Интернет-магазин. Начало загрузки ДК на сайт!","");
	
	СтруктураПараметровСайта = ПроцедурыОбменаССайтом.ПолучитьСтруктуруПараметровДляСоединения(ЭтотОбъект);
	
	МассивПодкаталогов = Новый Массив;
		
	Успешно = HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, МассивПодкаталогов, Истина, "catalog");
	
	Возврат Успешно;
	
КонецФункции	
 	
	Функция HTTPВыгрузитьНаСервер(СтруктураПараметровСайта, МассивПодкаталогов = Неопределено, ОжидатьЗавершенияИмпортаФайловСервером = Ложь,ТипСоединения = "catalog")
	
	
	Успешно    = Истина;
	
	ОтветСервера = "";
	Соединение = Неопределено;
	
	АдресДляРаботы = СтруктураПараметровСайта.АдресСкрипта + "?type=" + ТипСоединения; 
	
	СтрокаСообщенияПользователю = "";
	Успешно = ПроцедурыОбменаССайтом.HTTPВыполнитьАвторизациюДляСоединения(Соединение, СтруктураПараметровСайта, ОтветСервера, СтрокаСообщенияПользователю, ТипСоединения);
	
	Если Не ПустаяСтрока(СтрокаСообщенияПользователю) Тогда

		СообщитьОбОшибкеОбмена(СтрокаСообщенияПользователю, Истина);						
	КонецЕсли;
	
	Если Не Успешно Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	КукиИмя      	  = СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение 	  = СтрПолучитьСтроку(ОтветСервера, 3);
	ЗаголовкиЗапросов = "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	ОтобразитьСостояние("Запрос параметров обмена...");
	
	ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_Инициализация, ЗаголовкиЗапросов);
	
	Если ОтветСервера = Неопределено Тогда 
		СообщитьОбОшибкеОбмена("Не удалось получить параметры обмена с сервера.", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ZIPФайлыРазрешены = Ложь;
	ОграничениеРазмераФрагментаФайлаОбмена = 0;
	
	Если СтрЧислоСтрок(ОтветСервера) <> 2 тогда	
		СообщитьОбОшибкеОбмена("Не удалось прочитать ответ сервера. Параметры обмена не получены.", Истина);
		Возврат Ложь;
	КонецЕсли;
	
	ZIPФайлыРазрешены = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) = ОтветСервера_ZIPРазрешен;
	
	Попытка 
		ОграничениеРазмераФрагментаФайлаОбмена = Число(СтрЗаменить(СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 2))), ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена, ""));
	Исключение
		СообщитьОбИсключительнойОшибке(Истина);
		ОграничениеРазмераФрагментаФайлаОбмена = -1;
	КонецПопытки;	
	
	СписокФайловДляОтправки = ПолучитьСписокФайловДляОтправки(МассивПодкаталогов);
	

	Если ОграничениеРазмераФрагментаФайлаОбмена > 0 Тогда
		СписокФайловДляОтправки = РазделитьФайлыНаФрагменты(СписокФайловДляОтправки, ОграничениеРазмераФрагментаФайлаОбмена);
	КонецЕсли;	
	
	ВсегоФайлов = СписокФайловДляОтправки.Количество();
	
	Для Каждого ТекФайл Из СписокФайловДляОтправки цикл
		
		ОтобразитьСостояние("Идет отправка файла на сервер (" + Строка(СписокФайловДляОтправки.Индекс(ТекФайл) + 1) + " из " + Строка(ВсегоФайлов) + "): " + ТекФайл.Значение);
		
		ОтветСервера = HTTPОтправитьФайлНаСервер(ТекФайл.Значение, Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ПередачаФайла + ТекФайл.Представление, ЗаголовкиЗапросов);
		
		Если ZIPФайлыРазрешены Тогда
			Попытка
				УдалитьФайлы(ТекФайл.Значение);
			Исключение
			КонецПопытки;	
		КонецЕсли;	
		
		Если ОтветСервера = Неопределено Тогда
			СообщитьОбОшибкеОбмена("Не удалось получить ответ сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			Возврат Ложь;
		КонецЕсли;
		
		СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера,1)));
		
		Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
			
			СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
			Возврат Ложь;
			
		ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
			
			Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
				СообщитьПользователю("Получен расширенный статус успешного завершения сеанса", Истина, СтатусСообщения.Информация);
				СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);	
			КонецЕсли;
			
		Иначе
			
			СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Не получен статус завершения операции. Файл не отправлен (" + ТекФайл.Значение + ").", Истина);
			СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
			Возврат Ложь;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	ИмпортУспешноЗавершен = Ложь;
	
	//ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ИмпортФайлаСервером + "DK.xml", ЗаголовкиЗапросов);
	
	
	Если ОжидатьЗавершенияИмпортаФайловСервером Тогда
		
			
			ИмпортПродолжается = Истина;
			ТекущееСостояние = "";
			
			Пока ИмпортПродолжается Цикл
				
				//ОбработкаПрерыванияПользователя();
				ИмпортПродолжается = Ложь;
				
				ОтобразитьСостояние("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
				//Сообщить("Ожидание окончания загрузки данных сервером: " + ТекущееСостояние);
				ТекущееСостояние = "";
				
				ОтветСервера = ПроцедурыОбменаССайтом.HTTPПолучитьДанныеССервера(Соединение, АдресДляРаботы + ПараметрЗапросаHTTP_ИмпортФайлаСервером + "DK.xml", ЗаголовкиЗапросов);
				
				Если ОтветСервера = Неопределено Тогда 
					
					Успешно = Ложь;
					СообщитьОбОшибкеОбмена("Не удалось получить текущее состояние процесса обмена. Данные обмена отправлены, но не загружены.", Истина);
					
				ИначеЕсли СтрЧислоСтрок(ОтветСервера) = 0 Тогда
					Успешно = Ложь;
					СообщитьОбОшибкеОбмена("Не удалось прочитать данные о текущем состоянии процесса обмена. Данные обмена отправлены, но не загружены.", Истина);	
				Иначе
					
					СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1)));
					Если СостояниеОбмена = ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
						Успешно = Ложь;
						СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера.", Истина);
						СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
					ИначеЕсли СостояниеОбмена = ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
						ИмпортУспешноЗавершен = Истина;
					ИначеЕсли СостояниеОбмена = ОтветСервера_ВыполнениеТекущейОперации Тогда
						ТекущееСостояние = ТекущееСостояние + СтрПолучитьСтроку(ОтветСервера, 2);
						ИмпортПродолжается = Истина;
					Иначе
						Успешно = Ложь;
						СообщитьОбОшибкеОбмена("Произошла ошибка на стороне сервера. Получен неизвестный статус импорта.", Истина);
						СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера);
					КонецЕсли;
					
				КонецЕсли;					
				
			КонецЦикла;	//Импорт
			
						
	КонецЕсли;								
	
	Возврат Успешно;
	
КонецФункции	

Процедура СообщитьРасширенноеОписаниеОтветаСервера(ОтветСервера)
	
	ТекстСообщения = "Ответ сервера:" + Символы.ПС;
	
	Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
		Для ТекСтрока = 2 по СтрЧислоСтрок(ОтветСервера) Цикл
			ТекстСообщения = ТекстСообщения + СтрПолучитьСтроку(ОтветСервера, ТекСтрока) + Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	
	СообщитьПользователю(ТекстСообщения, Истина, СтатусСообщения.Информация);	
	
КонецПроцедуры	

Функция ПолучитьСписокФайловДляОтправки(МассивПодкаталогов);
	
	СписокФайлов = Новый СписокЗначений;
	Маска = "*.*";
	
	ВсеФайлыДляВыгрузки = НайтиФайлы(ИмяФайлаВыгрузки);
	
	Для Каждого ТекФайл Из ВсеФайлыДляВыгрузки цикл
		
		Если НЕ ТекФайл.ЭтоКаталог() Тогда
			ПолноеИмяФайлаДляСервера = ПодготовитьИмяФайлаДляСервера(ТекФайл);
			СписокФайлов.Добавить(ТекФайл.ПолноеИмя, ПолноеИмяФайлаДляСервера);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат СписокФайлов;
	
КонецФункции	

Процедура СообщитьОбОшибкеОбмена(ТекстСообщения, ИнформацияОВыгрузке)
	
	ТекстСообщения = ТекстСообщения + Символы.ПС + "Обмен не выполнен";
	СообщитьПользователю(ТекстСообщения, ИнформацияОВыгрузке, СтатусСообщения.Важное);	
	
КонецПроцедуры	

Процедура ОтобразитьСостояние(ТекстСообщения)
	#Если Клиент Тогда
		Состояние(ТекстСообщения);
	#Иначе
		//ЗаписатьВЛог("ОбменССайтом",ТекстСообщения,"Информация"); 	
	#КонецЕсли	
КонецПроцедуры

Функция ПодготовитьИмяФайлаДляСервера(ФайлОбъект)
	
	ПолноеИмяФайлаДляСервера = "";
	
	Если Найти(ФайлОбъект.Имя, ".xml") > 0 Тогда
		ПолноеИмяФайлаДляСервера = ФайлОбъект.Имя;
	КонецЕсли;
	
	ПолноеИмяФайлаДляСервера = ПолноеИмяФайлаДляСервера;
	
	Возврат ПолноеИмяФайлаДляСервера;
	
КонецФункции	

Функция РазделитьФайлыНаФрагменты(СписокФайлов, ОграничениеРазмераФрагмента)
	
	НовыйСписокФайлов = Новый СписокЗначений;
	Для Каждого ТекФайл Из СписокФайлов цикл
		
		ФайлНаДиске = Новый Файл(ТекФайл.Значение);
		Если ФайлНаДиске.Размер() > ОграничениеРазмераФрагмента Тогда
			МассивФрагментов = РазделитьФайл(ФайлНаДиске.ПолноеИмя, ОграничениеРазмераФрагмента);
			Для Каждого НовыйФайл Из МассивФрагментов Цикл
				НовыйСписокФайлов.Добавить(НовыйФайл, ТекФайл.Представление);
			КонецЦикла;	
			УдалитьФайлы(ФайлНаДиске.ПолноеИмя);
		Иначе
			НовыйСписокФайлов.Добавить(ТекФайл.Значение, ТекФайл.Представление);	
		КонецЕсли;	
		
	КонецЦикла;
	Возврат НовыйСписокФайлов;
	
КонецФункции

Процедура ДействияФормыДействие1(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

ПараметрЗапросаHTTP_Инициализация       	  = "&mode=init";
ПараметрЗапросаHTTP_ПередачаФайла       	  = "&mode=file&filename=";
ПараметрЗапросаHTTP_ИмпортФайлаСервером		  = "&mode=import&filename=";
ПараметрЗапросаHTTP_ПолучитьДанные	    	  = "&mode=query"; 
ПараметрЗапросаHTTP_УспешноеЗавершениеИмпорта = "&mode=success";

ОтветСервера_ZIPРазрешен							= "zip=yes";
ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена = "file_limit=";
ОтветСервера_УспешноеЗавершениеТекущейОперации 		= "success";
ОтветСервера_АварийноеЗавершениеТекущейОперации		= "failure";
ОтветСервера_ВыполнениеТекущейОперации 				= "progress";

изменения=Истина;

ПустаяХарактеристикаСсылка = Неопределено; //Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
НаименованиеНалога 			= "НДС";

БулевоЗначениеCML_Истина 	= "true";
БулевоЗначениеCML_Да = "Да";

СтрокаШапка="<?xml version=""1.0"" encoding=""UTF-8""?>
|             <КоммерческаяИнформация ВерсияСхемы=""2.021"" ДатаФормирования=""2012-11-02T12:41:37"">
|	<Классификатор>
|		<Ид>35</Ид>
|		<Наименование>Дисконтная карта</Наименование>
|		<Свойства>
|			<Свойство>
|				<Ид>781</Ид>
|				<Наименование>Сумма накоплений</Наименование>
|				<Множественное>false</Множественное>
|				<БитриксСортировка>100</БитриксСортировка>
|				<БитриксКод>DK_TOTAL</БитриксКод>
|				<БитриксЗначениеПоУмолчанию></БитриксЗначениеПоУмолчанию>
|				<БитриксТипСвойства>S</БитриксТипСвойства>
|				<БитриксСтрок>1</БитриксСтрок>
|				<БитриксКолонок>30</БитриксКолонок>
|				<БитриксТипСписка>L</БитриксТипСписка>
|				<БитриксТипыФайлов></БитриксТипыФайлов>
|				<БитриксКоличествоПолей></БитриксКоличествоПолей>
|				<БитриксСвязанныйИнфоблок></БитриксСвязанныйИнфоблок>
|				<БитриксОписаниеРазрешено>false</БитриксОписаниеРазрешено>
|				<БитриксПоискРазрешен>false</БитриксПоискРазрешен>
|				<БитриксФильтрРазрешен>false</БитриксФильтрРазрешен>
|				<БитриксРасширениеТипа></БитриксРасширениеТипа>
|				<БитриксОбязательное>false</БитриксОбязательное>
|			</Свойство>
|			<Свойство>
|				<Ид>782</Ид>
|				<Наименование>Скидка</Наименование>
|				<Множественное>false</Множественное>
|				<БитриксСортировка>200</БитриксСортировка>
|				<БитриксКод>DK_SALE</БитриксКод>
|				<БитриксЗначениеПоУмолчанию></БитриксЗначениеПоУмолчанию>
|				<БитриксТипСвойства>S</БитриксТипСвойства>
|				<БитриксСтрок>1</БитриксСтрок>
|				<БитриксКолонок>30</БитриксКолонок>
|				<БитриксТипСписка>L</БитриксТипСписка>
|				<БитриксТипыФайлов></БитриксТипыФайлов>
|				<БитриксКоличествоПолей></БитриксКоличествоПолей>
|				<БитриксСвязанныйИнфоблок></БитриксСвязанныйИнфоблок>
|				<БитриксОписаниеРазрешено>false</БитриксОписаниеРазрешено>
|				<БитриксПоискРазрешен>false</БитриксПоискРазрешен>
|				<БитриксФильтрРазрешен>false</БитриксФильтрРазрешен>
|				<БитриксРасширениеТипа></БитриксРасширениеТипа>
|				<БитриксОбязательное>false</БитриксОбязательное>
|			</Свойство>
|		</Свойства>
|		<Группы>
|		</Группы>
|	</Классификатор>
|	<Каталог>
|		<Ид>35</Ид>
|		<ИдКлассификатора>35</ИдКлассификатора>
|		<Наименование>Дисконтная карта</Наименование>
|		<БитриксКод>DISCOUNT_CARD</БитриксКод>
|		<БитриксСортировка>500</БитриксСортировка>
|		<БитриксURLСписок></БитриксURLСписок>
|		<БитриксURLДеталь></БитриксURLДеталь>
|		<БитриксURLРаздел></БитриксURLРаздел>
|		<БитриксКартинка></БитриксКартинка>
|		<БитриксИндексироватьЭлементы>true</БитриксИндексироватьЭлементы>
|		<БитриксИндексироватьРазделы>false</БитриксИндексироватьРазделы>
|		<БитриксДокументооборот>false</БитриксДокументооборот>
|		<БитриксПодписи>
|			<БитриксПодпись>
|				<Ид>ELEMENT_NAME</Ид>
|				<Значение>Элемент</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>ELEMENTS_NAME</Ид>
|				<Значение>Элементы</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>ELEMENT_ADD</Ид>
|				<Значение>Добавить элемент</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>ELEMENT_EDIT</Ид>
|				<Значение>Изменить элемент</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>ELEMENT_DELETE</Ид>
|				<Значение>Удалить элемент</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>SECTION_NAME</Ид>
|				<Значение>Раздел</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>SECTIONS_NAME</Ид>
|				<Значение>Разделы</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>SECTION_ADD</Ид>
|				<Значение>Добавить раздел</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>SECTION_EDIT</Ид>
|				<Значение>Изменить раздел</Значение>
|			</БитриксПодпись>
|			<БитриксПодпись>
|				<Ид>SECTION_DELETE</Ид>
|				<Значение>Удалить раздел</Значение>
|			</БитриксПодпись>
|		</БитриксПодписи>";

		
СтрокаНиз="	</Каталог>
|</КоммерческаяИнформация>";
